vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA276_DFP.pdsc
    <condition id='anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition'>
      <accept condition='allOf.component.gpio_adapter, driver.gpio.internal_condition'/>
    </condition>
    <condition id='allOf.component.gpio_adapter, driver.gpio.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
    </condition>
    <condition id='component.cmsis_drivers.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.ctimer_adapter.condition_id'>
      <require condition='allOf.driver.ctimer, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.ctimer, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='ctimer'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.ctimer_time_stamp_adapter.condition_id'>
      <require condition='allOf.driver.ctimer, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.enable_pca9544.condition_id'>
      <require condition='allOf.component.i2c_mux_pca954x, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.enable_pca9548.condition_id'>
      <require condition='allOf.component.i2c_mux_pca954x, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.flash_adapter.condition_id'>
      <require condition='allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MCXA276.internal_condition'>
      <require condition='anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition'>
      <accept condition='allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition'/>
    </condition>
    <condition id='allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mcxw_flash_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='romapi'/>
    </condition>
    <condition id='component.flash_nor_lpspi.condition_id'>
      <require condition='allOf.driver.lpspi, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpspi, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.gpio_adapter.condition_id'>
      <require condition='allOf.anyOf=driver.port, driver.gpio, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.port, driver.gpio, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.port.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.port.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='port'/>
    </condition>
    <condition id='component.i2c_adapter_interface.condition_id'>
      <require condition='allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c, device=MCXA276.internal_condition'>
      <require condition='anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c.internal_condition'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, allOf=component.i3c_adapter, driver.i3c.internal_condition'>
      <accept condition='allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'/>
      <accept condition='allOf.component.i3c_adapter, driver.i3c.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpi2c_adapter'/>
    </condition>
    <condition id='anyOf.driver.lpi2c.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
    </condition>
    <condition id='allOf.component.i3c_adapter, driver.i3c.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i3c_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i3c'/>
    </condition>
    <condition id='component.i2c_mux.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.i2c_mux_pca954x.condition_id'>
      <require condition='allOf.component.i2c_mux, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.component.i2c_mux, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_mux'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.i3c_adapter.condition_id'>
      <require condition='allOf.component.i2c_adapter_interface, driver.i3c, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.component.i2c_adapter_interface, driver.i3c, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_adapter_interface'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i3c'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.i3c_bus.condition_id'>
      <require condition='allOf.component.lists, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.component.lists, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.i3c_bus_adapter.condition_id'>
      <require condition='allOf.component.i3c_bus, driver.i3c, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.component.i3c_bus, driver.i3c, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i3c_bus'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i3c'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.led.condition_id'>
      <require condition='allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, driver.common, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, driver.common, device=MCXA276.internal_condition'>
      <require condition='anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='timer_manager'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.lists.condition_id'>
      <require condition='allOf.driver.common, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.lpi2c_adapter.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_adapter_interface'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.lpspi_adapter.condition_id'>
      <require condition='allOf.driver.common, driver.lpspi, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, driver.lpspi, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.lptmr_adapter.condition_id'>
      <require condition='allOf.driver.lptmr, device=MCXA276.internal_condition'/>
    </condition>
