vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA276_DFP.pdsc
    <condition id='allOf.driver.lptmr, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lptmr'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.lptmr_time_stamp_adapter.condition_id'>
      <require condition='allOf.driver.lptmr, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.lpuart_adapter.condition_id'>
      <require condition='allOf.anyOf=driver.lpuart, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpuart, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.lpuart.internal_condition'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.lpuart.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
    </condition>
    <condition id='component.mcxw_flash_adapter.condition_id'>
      <require condition='allOf.driver.romapi, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.romapi, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='romapi'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.mem_manager.condition_id'>
      <require condition='allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MCXA276.internal_condition'>
      <require condition='anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager_legacy'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager_light'/>
    </condition>
    <condition id='component.mem_manager_legacy.condition_id'>
      <require condition='allOf.component.mem_manager, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.component.mem_manager, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.mem_manager_light.condition_id'>
      <require condition='allOf.component.mem_manager, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.messaging.condition_id'>
      <require condition='allOf.component.lists, component.mem_manager, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.component.lists, component.mem_manager, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.mflash_offchip.condition_id'>
      <require condition='allOf.anyOf=driver.romapi, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.romapi, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.romapi.internal_condition'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.romapi.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='romapi'/>
    </condition>
    <condition id='component.mflash_onchip.condition_id'>
      <require condition='allOf.anyOf=driver.romapi, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.mflash_onchip_fmu.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.ostimer_adapter.condition_id'>
      <require condition='allOf.driver.ostimer, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.ostimer, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='ostimer'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='component.ostimer_time_stamp_adapter.condition_id'>
      <require condition='allOf.driver.ostimer, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.panic.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='component.power_manager_framework.condition_id'>
      <require condition='allOf.anyOf=driver.common, driver.crc, driver.mcx_cmc, driver.mcx_spc, driver.mcx_vbat, driver.wuu, component.lists, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.common, driver.crc, driver.mcx_cmc, driver.mcx_spc, driver.mcx_vbat, driver.wuu, component.lists, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.common, driver.crc, driver.mcx_cmc, driver.mcx_spc, driver.mcx_vbat, driver.wuu.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.common, driver.crc, driver.mcx_cmc, driver.mcx_spc, driver.mcx_vbat, driver.wuu.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='crc'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_cmc'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_spc'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_vbat'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wuu'/>
    </condition>
