vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA276_DFP.pdsc
    <condition id='device_id.MCXA276.internal_condition'>
      <accept Dname='MCXA276VLH' Dvendor='NXP:11'/>
      <accept Dname='MCXA276VLL' Dvendor='NXP:11'/>
      <accept Dname='MCXA276VLQ' Dvendor='NXP:11'/>
      <accept Dname='MCXA276VPN' Dvendor='NXP:11'/>
    </condition>
    <condition id='device.linker.condition_id'>
      <require condition='allOf.device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MCXA276.internal_condition'>
      <require condition='device_id.MCXA276.internal_condition'/>
    </condition>
    <condition id='device_ids.MCXA276.internal_condition'>
      <accept Dname='MCXA276VLH' Dvendor='NXP:11'/>
      <accept Dname='MCXA276VLL' Dvendor='NXP:11'/>
      <accept Dname='MCXA276VLQ' Dvendor='NXP:11'/>
      <accept Dname='MCXA276VPN' Dvendor='NXP:11'/>
    </condition>
    <condition id='allOf.toolchains=mdk, device_ids=MCXA276.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
      <require condition='device_ids.MCXA276.internal_condition'/>
    </condition>
    <condition id='toolchains.mdk.internal_condition'>
      <accept Tcompiler='ARMCC'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, device_ids=MCXA276.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
      <require condition='device_ids.MCXA276.internal_condition'/>
    </condition>
    <condition id='toolchains.armgcc.internal_condition'>
      <accept Tcompiler='GCC'/>
    </condition>
    <condition id='allOf.toolchains=iar, device_ids=MCXA276.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
      <require condition='device_ids.MCXA276.internal_condition'/>
    </condition>
    <condition id='toolchains.iar.internal_condition'>
      <accept Tcompiler='IAR'/>
    </condition>
    <condition id='device.project_template.condition_id'>
      <require condition='allOf.component.lpuart_adapter, device_id=MCXA276, device.startup, driver.clock, driver.common, driver.gpio, driver.lpuart, driver.port, driver.mcx_spc, driver.reset, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'/>
    </condition>
    <condition id='allOf.component.lpuart_adapter, device_id=MCXA276, device.startup, driver.clock, driver.common, driver.gpio, driver.lpuart, driver.port, driver.mcx_spc, driver.reset, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_adapter'/>
      <require condition='device_id.MCXA276.internal_condition'/>
      <require Cclass='Device' Cgroup='Startup' Csub=''/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='clock'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='port'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_spc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='reset'/>
      <require condition='anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'>
      <accept condition='allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition'/>
      <accept condition='allOf.utility.assert_lite, utility.debug_console_lite.internal_condition'/>
    </condition>
    <condition id='allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug console template config'/>
    </condition>
    <condition id='allOf.utility.assert_lite, utility.debug_console_lite.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert_lite'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
    </condition>
    <condition id='device.startup.condition_id'>
      <require condition='allOf.device.system, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.device.system, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MCXA276_system'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=iar.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=mdk.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
    </condition>
    <condition id='device.system.condition_id'>
      <require condition='allOf.device.CMSIS, device=MCXA276.internal_condition'/>
    </condition>
