vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA276_DFP.pdsc
    <condition id='driver.display-it6263.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.display-sn65dsi83.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.edma4.condition_id'>
      <require condition='allOf.driver.edma_soc, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.edma_soc, device_id=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='edma_soc'/>
      <require condition='device_id.MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.edma_soc.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.eim.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.ektf2k.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.eqdc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.erm.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.flexcan.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.flexcan_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma4, driver.flexcan, driver.edma4, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma4, driver.flexcan, driver.edma4, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.edma4.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexcan'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='edma'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.edma4.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='edma'/>
    </condition>
    <condition id='driver.flexio.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.flexio_i2c_master.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flexio, device_id=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio'/>
      <require condition='device_id.MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.flexio_mculcd.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.flexio_mculcd_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma4, driver.flexio_mculcd, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma4, driver.flexio_mculcd, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.edma4.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_mculcd'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.flexio_spi.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.flexio_spi_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma4, driver.flexio_spi, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma4, driver.flexio_spi, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.edma4.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.flexio_uart.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.flexio_uart_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma4, driver.flexio_uart, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma4, driver.flexio_uart, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.edma4.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.ft3267.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.ft5406.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.ft5406_rt.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.ft6x06.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.I2C, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.I2C, device=MCXA276.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='I2C' Capiversion='2.4.0'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.fxas21002cq.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.fxls8974cf.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.fxos8700cq.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.glikey.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.gpio.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
