vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA276_DFP.pdsc
    <condition id='driver.pwm.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.reset.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.romapi.condition_id'>
      <require condition='allOf.driver.common, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.rtc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.rtt.condition_id'>
      <require condition='allOf.driver.rtt.template, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.rtt.template, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rtt template'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.rtt.template.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.ssd1963.condition_id'>
      <require condition='allOf.driver.dbi, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.dbi, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dbi'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.st7796s.condition_id'>
      <require condition='allOf.driver.dbi, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.tdet.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.tma525b.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.trdc_1.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276, driver.trdc_soc.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device_id=MCXA276, driver.trdc_soc.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device_id.MCXA276.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='trdc_soc'/>
    </condition>
    <condition id='driver.trdc_soc.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.tsl2561.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.utick.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.video-common.condition_id'>
      <require condition='allOf.driver.common, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.video-i2c.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.waketimer.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.wuu.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='driver.wwdt.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA276.internal_condition'/>
    </condition>
    <condition id='utilities.misc_utilities.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, mdk, cores=cm33.condition_id'>
      <require condition='toolchains.armgcc, mdk.internal_condition'/>
      <require condition='cores.cm33.internal_condition'/>
    </condition>
    <condition id='toolchains.armgcc, mdk.internal_condition'>
      <accept Tcompiler='GCC'/>
      <accept Tcompiler='ARMCC'/>
    </condition>
    <condition id='utility.assert.condition_id'>
      <require condition='allOf.driver.common, utility.debug_console, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, utility.debug_console, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='utility.assert_lite.condition_id'>
      <require condition='allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='not.utility.assert.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='not.utility.assert.internal_condition'>
      <deny Cclass='Device' Cgroup='SDK Utilities' Csub='assert'/>
    </condition>
    <condition id='utility.debug_console.condition_id'>
      <require condition='allOf.component.serial_manager, driver.common, utility.str, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.component.serial_manager, driver.common, utility.str, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='utility.debug_console_lite.condition_id'>
      <require condition='allOf.anyOf=driver.lpuart, driver.common, not=utility.debug_console, utility.str, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpuart, driver.common, not=utility.debug_console, utility.str, device=MCXA276.internal_condition'>
      <require condition='anyOf.driver.lpuart.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='not.utility.debug_console.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='not.utility.debug_console.internal_condition'>
      <deny Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
    </condition>
    <condition id='utility.debug_console_template_config.condition_id'>
      <require condition='allOf.utility.debug_console, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.utility.debug_console, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
    <condition id='utility.format.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='utility.incbin.condition_id'>
      <require condition='allOf.device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, mdk.condition_id'>
      <require condition='toolchains.armgcc, mdk.internal_condition'/>
    </condition>
    <condition id='utility.shell.condition_id'>
      <require condition='allOf.component.lists, driver.common, utility.str, device=MCXA276.internal_condition'/>
    </condition>
    <condition id='allOf.component.lists, driver.common, utility.str, device=MCXA276.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MCXA276.internal_condition'/>
    </condition>
