vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA276_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='edma' Cversion='2.10.5' condition='driver.edma4.condition_id'>
      <description>EDMA Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_edma.h' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_edma_core.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='edma_soc' Cversion='2.0.0' condition='driver.edma_soc.condition_id'>
      <description>EDMA SOC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_edma_soc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_edma_soc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='eim' Cversion='2.0.1' condition='driver.eim.condition_id'>
      <description>EIM Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_eim.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_eim.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ektf2k' Cversion='1.0.0' condition='driver.ektf2k.condition_id'>
      <description>Driver ektf2k</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category='header' name='components/touch/ektf2k/fsl_ektf2k.h' projectpath='touchpanel'/>
        <file category='sourceC' name='components/touch/ektf2k/fsl_ektf2k.c' projectpath='touchpanel'/>
        <file category='include' name='components/touch/ektf2k/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='eqdc' Cversion='2.3.1' condition='driver.eqdc.condition_id'>
      <description>EQDC Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_eqdc.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_eqdc.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='erm' Cversion='2.0.1' condition='driver.erm.condition_id'>
      <description>ERM Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_erm.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_erm.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexcan' Cversion='2.13.1' condition='driver.flexcan.condition_id'>
      <description>FLEXCAN Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_flexcan.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_flexcan.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexcan_edma' Cversion='2.11.7' condition='driver.flexcan_edma.condition_id'>
      <description>FLEXCAN Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_flexcan_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_flexcan_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio' Cversion='2.3.0' condition='driver.flexio.condition_id'>
      <description>FLEXIO Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_flexio.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_flexio.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_i2c_master' Cversion='2.5.1' condition='driver.flexio_i2c_master.condition_id'>
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_flexio_i2c_master.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_flexio_i2c_master.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_mculcd' Cversion='2.1.0' condition='driver.flexio_mculcd.condition_id'>
      <description>FLEXIO MCULCD Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_flexio_mculcd.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_flexio_mculcd.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_mculcd_edma' Cversion='2.0.5' condition='driver.flexio_mculcd_edma.condition_id'>
      <description>FLEXIO MCULCD EDMA Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_flexio_mculcd_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_flexio_mculcd_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi' Cversion='2.3.5' condition='driver.flexio_spi.condition_id'>
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_flexio_spi.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_flexio_spi.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi_edma' Cversion='2.3.0' condition='driver.flexio_spi_edma.condition_id'>
      <description>FLEXIO SPI EDMA Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_flexio_spi_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_flexio_spi_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart' Cversion='2.5.1' condition='driver.flexio_uart.condition_id'>
      <description>FLEXIO UART Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_flexio_uart.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_flexio_uart.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart_edma' Cversion='2.4.1' condition='driver.flexio_uart_edma.condition_id'>
      <description>FLEXIO UART EDMA Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_flexio_uart_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_flexio_uart_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ft3267' Cversion='1.0.1' condition='driver.ft3267.condition_id'>
      <description>Touch panel controller FT3267 driver</description>
      <files>
        <file category='header' name='components/touch/ft3267/fsl_ft3267.h' projectpath='touchpanel'/>
        <file category='sourceC' name='components/touch/ft3267/fsl_ft3267.c' projectpath='touchpanel'/>
        <file category='include' name='components/touch/ft3267/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ft5406' Cversion='1.0.0' condition='driver.ft5406.condition_id'>
      <description>Driver ft5406</description>
      <files>
        <file category='header' name='components/touch/ft5406/fsl_ft5406.h' projectpath='touchpanel'/>
        <file category='sourceC' name='components/touch/ft5406/fsl_ft5406.c' projectpath='touchpanel'/>
        <file category='include' name='components/touch/ft5406/'/>
      </files>
    </component>
