vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA276_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ili9341' Cversion='1.0.2' condition='driver.ili9341.condition_id'>
      <description>Driver ili9341</description>
      <files>
        <file category='header' name='components/display/ili9341/fsl_ili9341.h' projectpath='lcdc'/>
        <file category='sourceC' name='components/display/ili9341/fsl_ili9341.c' projectpath='lcdc'/>
        <file category='include' name='components/display/ili9341/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='inputmux' Cversion='2.0.8' condition='driver.inputmux.condition_id'>
      <description>INPUTMUX Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_inputmux.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_inputmux.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='inputmux_connections' Cversion='2.0.0' condition='driver.inputmux_connections.condition_id'>
      <description>Inputmux_connections Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_inputmux_connections.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpadc' Cversion='2.9.1' condition='driver.lpadc.condition_id'>
      <description>LPADC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_lpadc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_lpadc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpc_freqme' Cversion='2.1.2' condition='driver.lpc_freqme.condition_id'>
      <description>lpc_freqme Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_freqme.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_freqme.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpcmp' Cversion='2.3.1' condition='driver.lpcmp.condition_id'>
      <description>LPCMP Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_lpcmp.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_lpcmp.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c' Cversion='2.5.7' condition='driver.lpi2c.condition_id'>
      <description>LPI2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_lpi2c.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_lpi2c.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_edma' Cversion='2.4.2' condition='driver.lpi2c_edma.condition_id'>
      <description>LPI2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_lpi2c_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_lpi2c_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi' Cversion='2.6.10' condition='driver.lpspi.condition_id'>
      <description>LPSPI Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_lpspi.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_lpspi.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi_edma' Cversion='2.4.6' condition='driver.lpspi_edma.condition_id'>
      <description>LPSPI Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_lpspi_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_lpspi_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lptmr' Cversion='2.2.0' condition='driver.lptmr.condition_id'>
      <description>LPTMR Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_lptmr.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_lptmr.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart' Cversion='2.9.0' condition='driver.lpuart.condition_id'>
      <description>LPUART Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_lpuart.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_lpuart.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_edma' Cversion='2.6.0' condition='driver.lpuart_edma.condition_id'>
      <description>LPUART Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_lpuart_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_lpuart_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lsm6dso' Cversion='1.0.0' condition='driver.lsm6dso.condition_id'>
      <description>Driver lsm6dso</description>
      <files>
        <file category='header' name='components/sensor/lsm6dso/fsl_lsm.h' projectpath='tilt_pedo'/>
        <file category='sourceC' name='components/sensor/lsm6dso/fsl_lsm.c' projectpath='tilt_pedo'/>
        <file category='include' name='components/sensor/lsm6dso/'/>
      </files>
    </component>
