vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA276_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mau' Cversion='2.0.0' condition='driver.mau.condition_id'>
      <description>MAU Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_mau.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_mau.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='max30101' Cversion='1.0.0' condition='driver.max30101.condition_id'>
      <description>Driver max30101</description>
      <files>
        <file category='header' name='components/sensor/max30101/fsl_max.h' projectpath='heartrate'/>
        <file category='sourceC' name='components/sensor/max30101/fsl_max.c' projectpath='heartrate'/>
        <file category='include' name='components/sensor/max30101/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_cmc' Cversion='2.2.3' condition='driver.mcx_cmc.condition_id'>
      <description>MCX_CMC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_cmc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_cmc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_spc' Cversion='2.7.0' condition='driver.mcx_spc.condition_id'>
      <description>MCX SPC Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_spc.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_spc.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_vbat' Cversion='2.3.1' condition='driver.mcx_vbat.condition_id'>
      <description>MCX VBAT Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_vbat.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_vbat.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mma8451q' Cversion='1.0.0' condition='driver.mma8451q.condition_id'>
      <description>Driver mma8451q</description>
      <files>
        <file category='header' name='components/sensor/mma8451q/fsl_mma.h' projectpath='accel'/>
        <file category='sourceC' name='components/sensor/mma8451q/fsl_mma.c' projectpath='accel'/>
        <file category='include' name='components/sensor/mma8451q/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mma8652fc' Cversion='1.0.0' condition='driver.mma8652fc.condition_id'>
      <description>Driver mma8652fc</description>
      <files>
        <file category='header' name='components/sensor/mma8652fc/fsl_mma.h' projectpath='accel'/>
        <file category='sourceC' name='components/sensor/mma8652fc/fsl_mma.c' projectpath='accel'/>
        <file category='include' name='components/sensor/mma8652fc/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='opamp' Cversion='2.0.0' condition='driver.opamp_fast.condition_id'>
      <description>OPAMP Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_opamp.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_opamp.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ostimer' Cversion='2.2.2' condition='driver.ostimer.condition_id'>
      <description>OSTimer Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_ostimer.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_ostimer.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='p3t1755' Cversion='2.0.0' condition='driver.p3t1755.condition_id'>
      <description>Driver p3t1755</description>
      <files>
        <file category='header' name='components/sensor/p3t1755/fsl_p3t1755.h' projectpath='component/p3t1755'/>
        <file category='sourceC' name='components/sensor/p3t1755/fsl_p3t1755.c' projectpath='component/p3t1755'/>
        <file category='include' name='components/sensor/p3t1755/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='port' Cversion='2.5.1' condition='driver.port.condition_id'>
      <description>PORT Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_port.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='psp27801' Cversion='1.0.0' condition='driver.psp27801.condition_id'>
      <description>Driver psp27801</description>
      <files>
        <file category='header' name='components/display/psp27801/fsl_psp27801.h' projectpath='oled'/>
        <file category='sourceC' name='components/display/psp27801/fsl_psp27801.c' projectpath='oled'/>
        <file category='include' name='components/display/psp27801/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='pwm' Cversion='2.9.0' condition='driver.pwm.condition_id'>
      <description>PWM Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_pwm.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_pwm.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='reset' Cversion='2.4.0' condition='driver.reset.condition_id'>
      <description>Reset Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_reset.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_reset.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='romapi' Cversion='2.0.1' condition='driver.romapi.condition_id'>
      <description>ROMAPI Driver</description>
      <files>
        <file category='header' name='devices/MCXA276/drivers/fsl_romapi.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rtc' Cversion='2.3.0' condition='driver.rtc.condition_id'>
      <description>RTC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA276/drivers/fsl_rtc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA276/drivers/fsl_rtc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA276/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rtt' Cversion='7.22.0' condition='driver.rtt.condition_id'>
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category='doc' name='components/rtt/License.txt' projectpath='rtt'/>
        <file category='doc' name='components/rtt/README.txt' projectpath='rtt'/>
        <file category='sourceC' name='components/rtt/RTT/SEGGER_RTT.c' projectpath='rtt/RTT'/>
        <file category='header' name='components/rtt/RTT/SEGGER_RTT.h' projectpath='rtt/RTT'/>
        <file category='sourceAsm' name='components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S' projectpath='rtt/RTT'/>
        <file category='sourceC' name='components/rtt/RTT/SEGGER_RTT_printf.c' projectpath='rtt/RTT'/>
        <file category='sourceC' name='components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c' projectpath='rtt/Syscalls'/>
        <file category='sourceC' name='components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c' projectpath='rtt/Syscalls'/>
        <file category='sourceC' name='components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c' projectpath='rtt/Syscalls'/>
        <file category='sourceC' name='components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c' projectpath='rtt/Syscalls'/>
        <file category='doc' name='components/rtt/License.txt' projectpath='rtt'/>
        <file category='doc' name='components/rtt/README.txt' projectpath='rtt'/>
        <file category='include' name='components/rtt/RTT/'/>
      </files>
    </component>
